app/controllers/api/v1/appointments_controller.rb

INSERT INTO "appointments" ("message", "date_of_appointment", "time_slot", "user_id", "doctor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @appointment = current_user.appointments.build(appointment_params)
    if @appointment.save

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "appointments" SET "message" = $1, "time_slot" = $2, "updated_at" = $3 WHERE "appointments"."id" = $4  [["message", "updated appointment"], ["time_slot", "11:30 Noon"], ["updated_at", "2022-06-14 19:01:20.878904"], ["id", 1]]
---
  def update
    @appointment = Appointment.find(params[:id])
    if @appointment.update(appointment_params)