app/controllers/api/v1/doctors_controller.rb

  def create
    @doctors = Doctor.new(doctors_params)
    if @doctors.save
---
INSERT INTO "doctors" ("first_name", "last_name", "specialty", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"