app/controllers/authentication_controller.rb

  def authenticate
    # byebug
    auth_token =
      AuthenticateUser.new(params[:user][:email], params[:user][:password]).call
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "foo@bar.com"], ["LIMIT", 1]]